<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#initialize-TVPB-(all-tap-tap)" data-toc-modified-id="initialize-TVPB-(all-tap-tap)-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>initialize TVPB (all tap-tap)</a></span><ul class="toc-item"><li><span><a href="#unique-ASC-sequentially-defined-values-by-set" data-toc-modified-id="unique-ASC-sequentially-defined-values-by-set-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>unique ASC sequentially-defined values by set</a></span><ul class="toc-item"><li><span><a href="#set-1" data-toc-modified-id="set-1-1.1.1"><span class="toc-item-num">1.1.1&nbsp;&nbsp;</span>set 1</a></span></li><li><span><a href="#set-2" data-toc-modified-id="set-2-1.1.2"><span class="toc-item-num">1.1.2&nbsp;&nbsp;</span>set 2</a></span></li><li><span><a href="#set-3" data-toc-modified-id="set-3-1.1.3"><span class="toc-item-num">1.1.3&nbsp;&nbsp;</span>set 3</a></span></li></ul></li></ul></li><li><span><a href="#trip-mode-choice-(trace-hhid-15)" data-toc-modified-id="trip-mode-choice-(trace-hhid-15)-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>trip mode choice (trace hhid 15)</a></span><ul class="toc-item"><li><span><a href="#unique-ASC-sequentially-defined-values-by-set" data-toc-modified-id="unique-ASC-sequentially-defined-values-by-set-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>unique ASC sequentially-defined values by set</a></span><ul class="toc-item"><li><span><a href="#set-1" data-toc-modified-id="set-1-2.1.1"><span class="toc-item-num">2.1.1&nbsp;&nbsp;</span>set 1</a></span></li><li><span><a href="#set-2" data-toc-modified-id="set-2-2.1.2"><span class="toc-item-num">2.1.2&nbsp;&nbsp;</span>set 2</a></span></li><li><span><a href="#set-3" data-toc-modified-id="set-3-2.1.3"><span class="toc-item-num">2.1.3&nbsp;&nbsp;</span>set 3</a></span></li></ul></li></ul></li></ul></div>

In [1]:
import pandas as pd

## initialize TVPB (all tap-tap)

In [24]:
df = pd.read_csv(
    '../output/trace.initialize_tvpb.offset0.compute_utils.tap_tap_w_preprocessor_expr_vals.csv'
)

### unique ASC sequentially-defined values by set

#### set 1

In [26]:
df[[col for col in df.columns if 'asc' in col and 'set1' in col]].drop_duplicates()

   asc_cr_set1  asc_lrt_set1  asc_brt_set1  asc_eb_set1
0          0.0           0.0           0.0          0.0

#### set 2

In [27]:
df[[col for col in df.columns if 'asc' in col and 'set2' in col]].drop_duplicates()

       asc_cr_set2  asc_lrt_set2  asc_brt_set2  asc_eb_set2
0              0.0          0.00          0.00         0.00
8674           0.0          0.00          0.28         0.28
8806           0.0          0.56          0.56         0.56
24432         -0.0          0.00          0.00        -0.28

#### set 3

In [28]:
df[[col for col in df.columns if 'asc' in col and 'set3' in col]].drop_duplicates()

   asc_cr_set3  asc_lrt_set3  asc_brt_set3  asc_eb_set3
0          0.0          0.00          0.00         0.00
1          0.0          0.56          0.56         0.56
3          0.0          0.00          0.00        -0.28
5          0.0          0.00          0.28         0.28

## trip mode choice (trace hhid 15)

In [10]:
df = pd.read_csv(
    '../output/trace.trip_mode_choice.tvpb_logsum_odt.work.WTW.build_virtual_path.compute_tap_tap_utils.compute_utils.tap_tap_w_preprocessor_expr_vals.csv',
    index_col=0,
)

### unique ASC sequentially-defined values by set

#### set 1

In [23]:
df[[col for col in df.columns if 'asc' in col and 'set1' in col]].drop_duplicates()

         asc_cr_set1  asc_lrt_set1  asc_brt_set1  asc_eb_set1
uid
8977765          0.0           0.0           0.0          0.0

#### set 2

In [22]:
df[[col for col in df.columns if 'asc' in col and 'set2' in col]].drop_duplicates()

         asc_cr_set2  asc_lrt_set2  asc_brt_set2  asc_eb_set2
uid
8977765          0.0          0.56          0.56         0.56
8977996          0.0          0.00          0.00         0.00

#### set 3

In [21]:
df[[col for col in df.columns if 'asc' in col and 'set3' in col]].drop_duplicates()

         asc_cr_set3  asc_lrt_set3  asc_brt_set3  asc_eb_set3
uid
8977765          0.0          0.00          0.00         0.00
8977996          0.0          0.56          0.56         0.56
8978618          0.0          0.00          0.00        -0.28